// Min

// 1 Створи об'єкт, що описує автомобіль
//  (виробник, модель, рік випуску, середня швидкість)
//  (обсяг паливного баку, середня витрата палива на 100 км., водії), 
// і наступні методи для роботи з цим об'єктом:
//-- Метод, який виводить на екран інформацію про автомобіль.
//-- Додавання ім’я водія у список
//-- Перевірка водія на наявність його ім’я у списку
//-- Підрахунок необхідного часу та кількості палива для подолання переданої відстані з середньою швидкістю. Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину. 

let array = []
const car = {

    "Країна виробник":"Japan",
    "Модель":"Hyundai",
    "Бензобак": 40,
    "Середня витрата палива на 100км": 8,
    "Власники":[],

    infoAboutCar: function () {

        for(let key in car) {

            switch(typeof this.key == 'function') {

                case true:
                    
                    array.splice(`${key},${car[key]}`)
                
                ;

                case false:
                    
                    array.push(`${key},${car[key]}`)
                
                ;
                
            } 


            console.log(array)
        }
        
    }
}

car.infoAboutCar()


// const person = {
//     firstName: 'John',
//     lastName: 'Doe',
//     age: 30
//   };
  
//   for (let key in person) {
//     if (person.hasOwnProperty(key)) {
//       console.log(`Властивість: ${key}, Значення: ${person[key]}`);
//     }
//   }

